In [213]:
import numpy as np 
import pandas as pd

In [214]:
myDictionary = {"dogukan":23,"mehmet":16,"tugce":18}

In [215]:
pd.Series(myDictionary)
# esas veriler 23,16 ve 18 olduğu için datatype:dtype -> int olarak verilir.

dogukan    23
mehmet     16
tugce      18
dtype: int64

In [216]:
myAges = [10,20,30]
myNames = ["a","b","c"]

In [217]:
pd.Series(myAges)

0    10
1    20
2    30
dtype: int64

In [218]:
pd.Series(myNames,myAges)

# pd.Series(value,key)

10    a
20    b
30    c
dtype: object

In [219]:
pd.Series(data=myNames,index=myAges)

10    a
20    b
30    c
dtype: object

In [220]:
firstData = pd.Series([1,2,3,4],["a","b","c","d"])

In [221]:
secondData = pd.Series([10,20,30,40],["a","b","c","d"])

In [222]:
lastData = firstData+secondData
lastData

a    11
b    22
c    33
d    44
dtype: int64

In [223]:
firstNewData = pd.Series([1,2,3,4],["a","b","c","d"])

In [224]:
secondNewData = pd.Series([10,20,30,40],["a","e","f","d"])

In [225]:
lastNewData = firstNewData+secondNewData
lastNewData

a    11.0
b     NaN
c     NaN
d    44.0
e     NaN
f     NaN
dtype: float64

In [226]:
############################################

In [227]:
newOurData = np.random.rand(5,5)
newOurData

array([[0.04338131, 0.78372527, 0.96884636, 0.69438844, 0.3818378 ],
       [0.08333099, 0.9850718 , 0.25117737, 0.4721385 , 0.88193025],
       [0.2796872 , 0.20820928, 0.34856383, 0.88322587, 0.06042677],
       [0.34659113, 0.25984164, 0.18823122, 0.43350018, 0.03506912],
       [0.3053126 , 0.05902385, 0.45625592, 0.57514293, 0.84589732]])

In [228]:
newDataFrame = pd.DataFrame(newOurData)
newDataFrame

          0         1         2         3         4
0  0.043381  0.783725  0.968846  0.694388  0.381838
1  0.083331  0.985072  0.251177  0.472138  0.881930
2  0.279687  0.208209  0.348564  0.883226  0.060427
3  0.346591  0.259842  0.188231  0.433500  0.035069
4  0.305313  0.059024  0.456256  0.575143  0.845897

In [229]:
type(newDataFrame)

pandas.core.frame.DataFrame

In [230]:
type(newDataFrame[0])

pandas.core.series.Series

In [231]:
newOurDataFrame = pd.DataFrame(newOurData,index=["a","b","c","d","e"],columns=["id","age","salary","hour","year"])
newOurDataFrame

         id       age    salary      hour      year
a  0.043381  0.783725  0.968846  0.694388  0.381838
b  0.083331  0.985072  0.251177  0.472138  0.881930
c  0.279687  0.208209  0.348564  0.883226  0.060427
d  0.346591  0.259842  0.188231  0.433500  0.035069
e  0.305313  0.059024  0.456256  0.575143  0.845897

In [232]:
newOurDataFrame["salary"]

a    0.968846
b    0.251177
c    0.348564
d    0.188231
e    0.456256
Name: salary, dtype: float64

In [233]:
newOurDataFrame[["salary","year"]]

     salary      year
a  0.968846  0.381838
b  0.251177  0.881930
c  0.348564  0.060427
d  0.188231  0.035069
e  0.456256  0.845897

In [234]:
newOurDataFrame.loc["c"] # burada direkt row değerlerini almak için loc fonksiyonunu kullanırız.

id        0.279687
age       0.208209
salary    0.348564
hour      0.883226
year      0.060427
Name: c, dtype: float64

In [235]:
newOurDataFrame.iloc[1] # iloc index location of row

id        0.083331
age       0.985072
salary    0.251177
hour      0.472138
year      0.881930
Name: b, dtype: float64

In [236]:
newOurDataFrame

         id       age    salary      hour      year
a  0.043381  0.783725  0.968846  0.694388  0.381838
b  0.083331  0.985072  0.251177  0.472138  0.881930
c  0.279687  0.208209  0.348564  0.883226  0.060427
d  0.346591  0.259842  0.188231  0.433500  0.035069
e  0.305313  0.059024  0.456256  0.575143  0.845897

In [237]:
# yeni column ekleme
newOurDataFrame["uid"] = newOurDataFrame["id"]*2
newOurDataFrame

         id       age    salary      hour      year       uid
a  0.043381  0.783725  0.968846  0.694388  0.381838  0.086763
b  0.083331  0.985072  0.251177  0.472138  0.881930  0.166662
c  0.279687  0.208209  0.348564  0.883226  0.060427  0.559374
d  0.346591  0.259842  0.188231  0.433500  0.035069  0.693182
e  0.305313  0.059024  0.456256  0.575143  0.845897  0.610625

In [238]:
# delete column    column -> axis=1, row -> axis=0
newOurDataFrame.drop("uid",axis=1)

         id       age    salary      hour      year
a  0.043381  0.783725  0.968846  0.694388  0.381838
b  0.083331  0.985072  0.251177  0.472138  0.881930
c  0.279687  0.208209  0.348564  0.883226  0.060427
d  0.346591  0.259842  0.188231  0.433500  0.035069
e  0.305313  0.059024  0.456256  0.575143  0.845897

In [239]:
# axis default olarak 0 olduğu için direkt belirtilen satırı siler.
newOurDataFrame.drop("a")

         id       age    salary      hour      year       uid
b  0.083331  0.985072  0.251177  0.472138  0.881930  0.166662
c  0.279687  0.208209  0.348564  0.883226  0.060427  0.559374
d  0.346591  0.259842  0.188231  0.433500  0.035069  0.693182
e  0.305313  0.059024  0.456256  0.575143  0.845897  0.610625

In [240]:
# inplace değeri default olarak False olarak ayarlanmıştır.
newOurDataFrame.drop("uid",axis=1,inplace=True)
# biz bunu yazmazsak default olarak False olur ve veriler kalıcı olarak silinmez 
# silinmiş olarak gösterilir.
# inplace = True dersek kalıcı silinir. 
# inplace = true yerinde sil

In [241]:
newOurDataFrame

         id       age    salary      hour      year
a  0.043381  0.783725  0.968846  0.694388  0.381838
b  0.083331  0.985072  0.251177  0.472138  0.881930
c  0.279687  0.208209  0.348564  0.883226  0.060427
d  0.346591  0.259842  0.188231  0.433500  0.035069
e  0.305313  0.059024  0.456256  0.575143  0.845897

In [242]:
# verilere ulaşma işlemi
newOurDataFrame.loc["a"]["id"] # bu şekilde istenen verinin değerlerine tek tek ulaşabiliriz.
newOurDataFrame.loc["a","salary"] # şeklinde de tek köşeli parantez içerisinde verilere erişebiliriz.

0.968846357286138

In [243]:
booleanFrame=newOurDataFrame > 0.8
booleanFrame

      id    age  salary   hour   year
a  False  False    True  False  False
b  False   True   False  False   True
c  False  False   False   True  False
d  False  False   False  False  False
e  False  False   False  False   True

In [244]:
newOurDataFrame[newOurDataFrame>0.8]

   id       age    salary      hour      year
a NaN       NaN  0.968846       NaN       NaN
b NaN  0.985072       NaN       NaN  0.881930
c NaN       NaN       NaN  0.883226       NaN
d NaN       NaN       NaN       NaN       NaN
e NaN       NaN       NaN       NaN  0.845897

In [245]:
newOurDataFrame[newOurDataFrame["age"]>0.8]

         id       age    salary      hour     year
b  0.083331  0.985072  0.251177  0.472138  0.88193

In [246]:
newOurDataFrame

         id       age    salary      hour      year
a  0.043381  0.783725  0.968846  0.694388  0.381838
b  0.083331  0.985072  0.251177  0.472138  0.881930
c  0.279687  0.208209  0.348564  0.883226  0.060427
d  0.346591  0.259842  0.188231  0.433500  0.035069
e  0.305313  0.059024  0.456256  0.575143  0.845897

In [247]:
newOurDataFrame.reset_index()
# daha sonra tekrardan datamızı çağırırsak eski haliyle geilr.
# inplace'i tekrar çağırmak gerekli.

  index        id       age    salary      hour      year
0     a  0.043381  0.783725  0.968846  0.694388  0.381838
1     b  0.083331  0.985072  0.251177  0.472138  0.881930
2     c  0.279687  0.208209  0.348564  0.883226  0.060427
3     d  0.346591  0.259842  0.188231  0.433500  0.035069
4     e  0.305313  0.059024  0.456256  0.575143  0.845897

In [248]:
newOurDataFrame.reset_index(inplace=True)

In [249]:
newOurDataFrame

  index        id       age    salary      hour      year
0     a  0.043381  0.783725  0.968846  0.694388  0.381838
1     b  0.083331  0.985072  0.251177  0.472138  0.881930
2     c  0.279687  0.208209  0.348564  0.883226  0.060427
3     d  0.346591  0.259842  0.188231  0.433500  0.035069
4     e  0.305313  0.059024  0.456256  0.575143  0.845897

In [250]:
newIndex = ["aa","bb","cc","dd","ee"]
newOurDataFrame["New Index"] = newIndex

In [251]:
newOurDataFrame

  index        id       age    salary      hour      year New Index
0     a  0.043381  0.783725  0.968846  0.694388  0.381838        aa
1     b  0.083331  0.985072  0.251177  0.472138  0.881930        bb
2     c  0.279687  0.208209  0.348564  0.883226  0.060427        cc
3     d  0.346591  0.259842  0.188231  0.433500  0.035069        dd
4     e  0.305313  0.059024  0.456256  0.575143  0.845897        ee

In [252]:
newOurDataFrame.set_index("New Index")

          index        id       age    salary      hour      year
New Index
aa            a  0.043381  0.783725  0.968846  0.694388  0.381838
bb            b  0.083331  0.985072  0.251177  0.472138  0.881930
cc            c  0.279687  0.208209  0.348564  0.883226  0.060427
dd            d  0.346591  0.259842  0.188231  0.433500  0.035069
ee            e  0.305313  0.059024  0.456256  0.575143  0.845897

In [253]:
newOurDataFrame # inplace = True yaparak değeri koru

  index        id       age    salary      hour      year New Index
0     a  0.043381  0.783725  0.968846  0.694388  0.381838        aa
1     b  0.083331  0.985072  0.251177  0.472138  0.881930        bb
2     c  0.279687  0.208209  0.348564  0.883226  0.060427        cc
3     d  0.346591  0.259842  0.188231  0.433500  0.035069        dd
4     e  0.305313  0.059024  0.456256  0.575143  0.845897        ee

In [254]:
newOurDataFrame.set_index("New Index",inplace=True)
newOurDataFrame

          index        id       age    salary      hour      year
New Index
aa            a  0.043381  0.783725  0.968846  0.694388  0.381838
bb            b  0.083331  0.985072  0.251177  0.472138  0.881930
cc            c  0.279687  0.208209  0.348564  0.883226  0.060427
dd            d  0.346591  0.259842  0.188231  0.433500  0.035069
ee            e  0.305313  0.059024  0.456256  0.575143  0.845897

In [255]:
newOurDataFrame

          index        id       age    salary      hour      year
New Index
aa            a  0.043381  0.783725  0.968846  0.694388  0.381838
bb            b  0.083331  0.985072  0.251177  0.472138  0.881930
cc            c  0.279687  0.208209  0.348564  0.883226  0.060427
dd            d  0.346591  0.259842  0.188231  0.433500  0.035069
ee            e  0.305313  0.059024  0.456256  0.575143  0.845897

In [256]:
newOurDataFrame.loc["aa"]

index            a
id        0.043381
age       0.783725
salary    0.968846
hour      0.694388
year      0.381838
Name: aa, dtype: object

In [257]:
# MultiIndex
outIndex = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]
inIndex = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

combineInAndOut = list(zip(outIndex,inIndex))
combineInAndOut

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [258]:
MultiIndexedCombineInAndOut = pd.MultiIndex.from_tuples(combineInAndOut) # () tuple tipinde 
MultiIndexedCombineInAndOut

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [259]:
myList = [[1,"a"],[2,"b"],[3,"c"],[4,"d"],[5,"e"],[6,"f"]]
myNumpyList = np.array(myList)
myNumpyList

array([['1', 'a'],
       ['2', 'b'],
       ['3', 'c'],
       ['4', 'd'],
       ['5', 'e'],
       ['6', 'f']], dtype='<U11')

In [260]:
myDataFrame = pd.DataFrame(myNumpyList,index=MultiIndexedCombineInAndOut,columns=["Yaş","Meslek"])
myDataFrame

                   Yaş Meslek
Simpson    Homer     1      a
           Bart      2      b
           Marge     3      c
South Park Cartman   4      d
           Kenny     5      e
           Kyle      6      f

In [261]:
myDataFrame.loc["Simpson"]

      Yaş Meslek
Homer   1      a
Bart    2      b
Marge   3      c

In [262]:
myDataFrame.iloc[0]

Yaş       1
Meslek    a
Name: (Simpson, Homer), dtype: object

In [263]:
myDataFrame.loc["South Park"].loc["Kyle"]

Yaş       6
Meslek    f
Name: Kyle, dtype: object

In [264]:
myDataFrame.index.names = ["Film Name","Character Name"]

In [265]:
myDataFrame

                          Yaş Meslek
Film Name  Character Name
Simpson    Homer            1      a
           Bart             2      b
           Marge            3      c
South Park Cartman          4      d
           Kenny            5      e
           Kyle             6      f

In [266]:
# mynewdata

In [267]:
days = ["monday","tuesday","wednesday"]
temperatures = [[30.0,20.0,40.0],[29,np.nan,np.nan],[np.nan,25,38]]

In [268]:
myPandasDataFrame = pd.DataFrame(temperatures,index=days,columns=["Istanbul","Ankara","Izmir"])

In [269]:
myPandasDataFrame

           Istanbul  Ankara  Izmir
monday         30.0    20.0   40.0
tuesday        29.0     NaN    NaN
wednesday       NaN    25.0   38.0

In [270]:
# easy way
myDictionaryData = {"a":[1,2,3],"b":[1,np.nan,np.nan],"c":[np.nan,2,3]}
myDictionaryDataFrame = pd.DataFrame(myDictionaryData)
myDictionaryDataFrame

   a    b    c
0  1  1.0  NaN
1  2  NaN  2.0
2  3  NaN  3.0

In [271]:
myPandasDataFrame.dropna() # dropna -> drop not available
# bu durumda da herhangi bir satırda NaN değeri varsa o satırı tümüyle siler.

        Istanbul  Ankara  Izmir
monday      30.0    20.0   40.0

In [272]:
myPandasDataFrame.dropna(axis=1) # axis değerini 1 yaparak sütuna geçeriz ve sütun'a bakarak silme işlemi yapar.

Empty DataFrame
Columns: []
Index: [monday, tuesday, wednesday]

newDatas = {"Istanbul","Ankara","Izmir","Antalya"}
daysTemp = [[1,2,np.nan],[5,np.nan,20],[21,34,np.nan],[np.nan,np.nan,20]]
daysOfWeek = ["monday","tuesday","wednesday"]
newDatasFrame = pd.DataFrame(daysTemp,index=daysOfWeek,columns=newDatas)
newDatasFrame

In [273]:
myPandasDataFrame.dropna(thresh=2) # axis = default 0 -> horizontal /// yatay olan verilerde en az 2 nan varsa siler, tuesday içerisinde 2 nan olduğu için o satır silindi.

           Istanbul  Ankara  Izmir
monday         30.0    20.0   40.0
wednesday       NaN    25.0   38.0

In [274]:
myPandasDataFrame

           Istanbul  Ankara  Izmir
monday         30.0    20.0   40.0
tuesday        29.0     NaN    NaN
wednesday       NaN    25.0   38.0

In [275]:
# içerisinde nan olan değerleri sıfır yap

myPandasDataFrame.fillna(0)

           Istanbul  Ankara  Izmir
monday         30.0    20.0   40.0
tuesday        29.0     0.0    0.0
wednesday       0.0    25.0   38.0

## GroupBy

In [276]:
myInformationDictionary = {"Departments":["Software","Softare","Software","Electric","Electric","Machine"],
                            "Names":["Dogukan","Tugce","Mehmet","John","Jack","George"],
                            "Salary":[1,2,3,4,5,6]}

myInformationDataFrame = pd.DataFrame(myInformationDictionary)

In [277]:
myInformationDataFrame

  Departments    Names  Salary
0    Software  Dogukan       1
1     Softare    Tugce       2
2    Software   Mehmet       3
3    Electric     John       4
4    Electric     Jack       5
5     Machine   George       6

In [278]:
departmentsGroupObject=myInformationDataFrame.groupby("Departments")
departmentsGroupObject

In [279]:
departmentsGroupObject.count()

             Names  Salary
Departments
Electric         2       2
Machine          1       1
Softare          1       1
Software         2       2

In [280]:
departmentsGroupObject.mean()

C:\Users\dgkn5\AppData\Local\Temp\ipykernel_4716\2588832696.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  departmentsGroupObject.mean()

             Salary
Departments
Electric        4.5
Machine         6.0
Softare         2.0
Software        2.0

In [281]:
departmentsGroupObject.max()

              Names  Salary
Departments
Electric       John       5
Machine      George       6
Softare       Tugce       2
Software     Mehmet       3

In [282]:
departmentsGroupObject.min()

               Names  Salary
Departments
Electric        Jack       4
Machine       George       6
Softare        Tugce       2
Software     Dogukan       1

In [283]:
departmentsGroupObject.describe()

            Salary
             count mean       std  min   25%  50%   75%  max
Departments
Electric       2.0  4.5  0.707107  4.0  4.25  4.5  4.75  5.0
Machine        1.0  6.0       NaN  6.0  6.00  6.0  6.00  6.0
Softare        1.0  2.0       NaN  2.0  2.00  2.0  2.00  2.0
Software       2.0  2.0  1.414214  1.0  1.50  2.0  2.50  3.0

## concat

In [284]:
firstData = {"Name":["Ahmet","Mehmet","Aslan","Ece"],
             "Spor":["Swimming","Running","Basketball","Running"],
             "Calories":[100,200,300,400]}

secondData = {"Name":["Ayşe","Rahmetullah","Melih","Ecem"],
             "Spor":["Swimming","Running","Basketball","Running"],
             "Calories":[100,200,300,400]}

thirdData = {"Name":["Doğukan","Nihat","Nurullah","Kürşat"],
             "Spor":["Swimming","Running","Basketball","Running"],
             "Calories":[100,200,300,400]}

In [285]:
firstDataFrame = pd.DataFrame(firstData,index=[0,1,2,3])
secondDataFrame = pd.DataFrame(secondData,index=[4,5,6,7])
thirdDataFrame = pd.DataFrame(thirdData,index=[8,9,10,11])

In [286]:
pd.concat([firstDataFrame,secondDataFrame,thirdDataFrame])

           Name        Spor  Calories
0         Ahmet    Swimming       100
1        Mehmet     Running       200
2         Aslan  Basketball       300
3           Ece     Running       400
4          Ayşe    Swimming       100
5   Rahmetullah     Running       200
6         Melih  Basketball       300
7          Ecem     Running       400
8       Doğukan    Swimming       100
9         Nihat     Running       200
10     Nurullah  Basketball       300
11       Kürşat     Running       400

## merge

merge içerisinde farklı verilerin olduğu birden fazla veriyi birleştirmek için kullanılır.
ortak column name ile birleştirme yapılır.

In [287]:
firstMergeData = {"Name":["Ahmet","Mehmet","Aslan","Ece"],
                 "Calories":[100,200,300,400]}

secondMergeData = {"Name":["Ayşe","Rahmetullah","Melih","Ecem"],
                  "Steps":[10,20,30,40]}

In [288]:
firstMergeDataFrame = pd.DataFrame(firstMergeData)
firstMergeDataFrame

     Name  Calories
0   Ahmet       100
1  Mehmet       200
2   Aslan       300
3     Ece       400

In [289]:
secondMergeDataFrame = pd.DataFrame(secondMergeData)
secondMergeDataFrame

          Name  Steps
0         Ayşe     10
1  Rahmetullah     20
2        Melih     30
3         Ecem     40

In [290]:
pd.merge(firstMergeDataFrame,secondMergeDataFrame,on="Name")

Empty DataFrame
Columns: [Name, Calories, Steps]
Index: []

In [291]:
funcData = {"Name":["Dogukan","Tugce","Mehmet"],
            "Department":["Software","Software","Hardware"],
            "Salary":[100,200,300]}

In [292]:
funcDataFrame = pd.DataFrame(funcData)
funcData

{'Name': ['Dogukan', 'Tugce', 'Mehmet'],
 'Department': ['Software', 'Software', 'Hardware'],
 'Salary': [100, 200, 300]}

In [293]:
funcDataFrame["Department"]

0    Software
1    Software
2    Hardware
Name: Department, dtype: object

In [294]:
funcDataFrame["Department"].unique()

array(['Software', 'Hardware'], dtype=object)

In [295]:
funcDataFrame["Department"].nunique() # number of unique

2

In [296]:
funcDataFrame["Department"].value_counts()

Software    2
Hardware    1
Name: Department, dtype: int64

In [297]:
# fonksiyonları uygulama şekli

def fromBrutToNet(salary):
    return salary*0.66

funcDataFrame["Salary"].apply(fromBrutToNet)

0     66.0
1    132.0
2    198.0
Name: Salary, dtype: float64

In [298]:
funcDataFrame.isnull()

    Name  Department  Salary
0  False       False   False
1  False       False   False
2  False       False   False

In [299]:
newDataAgain = {"Class":["South Park","South Park","Simpson","Simpson"],
                "Name":["Cartman","Kenny","Homer","Bard"],
                "Age":[10,20,30,40]}

In [300]:
dataDataFrame = pd.DataFrame(newDataAgain)
dataDataFrame

        Class     Name  Age
0  South Park  Cartman   10
1  South Park    Kenny   20
2     Simpson    Homer   30
3     Simpson     Bard   40

In [301]:
dataDataFrame.pivot_table(values="Age",index=["Class","Name"])

                    Age
Class      Name
Simpson    Bard      40
           Homer     30
South Park Cartman   10
           Kenny     20